{
  "users": [
    {
      "id": "f924",
      "name": "full stack developer ",
      "email": "fsdeveloper@gmail.com",
      "password": "reactismyfavourite",
      "avatar": "",
      "createdAt": "2025-11-21T13:13:40.202Z",
      "isAdmin": true
    },
    {
      "name": "jaswanth",
      "email": "evarrameerantha@gmail.com",
      "password": "Jaswanth1234!",
      "avatar": "",
      "createdAt": "2025-11-23T11:55:00.009Z",
      "id": "suZ7rDo",
      "isAdmin": false
    },
    {
      "name": "Jaswanth",
      "email": "hjakbgdys@gmail.com",
      "password": "areyentraidhi",
      "avatar": "",
      "createdAt": "2025-11-25T04:58:57.713Z",
      "id": "6jA_Ou-",
      "isAdmin": false
    },
    {
      "id": "1a4d",
      "name": "ala kadhu ra",
      "email": "alakaadhu@gmail.com",
      "password": "hkalnsd ",
      "avatar": "",
      "createdAt": "2025-11-28T16:21:47.310Z",
      "isAdmin": false
    },
    {
      "id": "d94d",
      "name": "losish",
      "email": "losish@gmail.com",
      "password": "cookbook1234",
      "avatar": "",
      "createdAt": "2025-12-02T06:40:58.737Z",
      "isAdmin": false
    },
    {
      "id": "da3a",
      "name": "chaithu ",
      "email": "chaithu@gmail.com",
      "password": "summerinternship",
      "avatar": "",
      "createdAt": "2025-12-02T07:06:24.155Z",
      "isAdmin": false
    },
    {
      "id": "4ba7",
      "name": "sesha ",
      "email": "sesha@gmail.com",
      "password": "hJDNAD",
      "avatar": "",
      "createdAt": "2025-12-02T07:17:07.879Z",
      "isAdmin": false
    },
    {
      "id": "5053",
      "name": "losishhhh",
      "email": "losishhhh@gmail.com",
      "password": "jsismyfavourite",
      "avatar": "",
      "createdAt": "2025-12-02T07:21:10.982Z",
      "isAdmin": false
    }
  ],
  "recipes": [
    {
      "id": "6",
      "title": "Greek Salad",
      "description": "Fresh salad with tomatoes, cucumbers, olives, and feta cheese.",
      "ingredients": [
        "3 Tomatoes",
        "1 Cucumber",
        "1 Red Onion",
        "Kalamata Olives",
        "200g Feta Cheese",
        "Olive Oil",
        "Oregano"
      ],
      "steps": [
        "Wash and chop 3 large ripe tomatoes into bite-sized chunks. Peel and dice 1 cucumber into similar-sized pieces. Keep the vegetables chunky for authentic texture.",
        "Peel and slice 1 red onion into thin half-moons. If you prefer milder flavor, soak the onion slices in cold water for 10 minutes, then drain.",
        "In a large serving bowl, combine the chopped tomatoes, cucumber, sliced onion, and a generous handful of Kalamata olives (about 1/2 cup).",
        "Cut 200g block of feta cheese into one large piece or cubes and place on top of the vegetables. This is the traditional way to serve Greek salad.",
        "Drizzle generously with extra virgin olive oil (about 1/4 cup), sprinkle with dried oregano, and season with salt and freshly ground black pepper. Toss gently just before serving. Serve with crusty bread to soak up the delicious juices!"
      ],
      "prepTime": "40 mins",
      "cookTime": "0 mins",
      "servings": 2,
      "image": "https://images.unsplash.com/photo-1540189549336-e6e99c3679fe?auto=format&fit=crop&w=800&q=80",
      "cuisine": "Greek",
      "tags": [
        "Salad",
        "Vegetarian",
        "Healthy"
      ],
      "isFavorite": false
    },
    {
      "id": "8",
      "title": "Sushi Rolls",
      "description": "Vinegared rice accompanied by various ingredients, such as seafood and vegetables.",
      "ingredients": [
        "2 cups Sushi Rice",
        "Nori Sheets",
        "Fresh Salmon",
        "Avocado",
        "Cucumber",
        "Soy Sauce"
      ],
      "steps": [
        "Rinse 2 cups sushi rice thoroughly until water runs clear. Cook according to package instructions. While still hot, mix with 3 tbsp rice vinegar, 1 tbsp sugar, and 1 tsp salt. Spread on a tray to cool to room temperature.",
        "Prepare your fillings: slice fresh salmon into thin strips, cut avocado into long slices, and julienne cucumber into matchsticks. Keep everything chilled.",
        "Place a bamboo sushi mat on your work surface and cover with plastic wrap. Put one nori sheet shiny side down on the mat.",
        "With wet hands, spread a thin, even layer of sushi rice over the nori, leaving a 1-inch border at the top edge. Arrange your fillings (salmon, avocado, cucumber) in a line across the center of the rice.",
        "Using the bamboo mat, roll the sushi tightly away from you, applying gentle pressure. Seal the edge with a little water. Use a sharp, wet knife to slice the roll into 6-8 pieces. Serve with soy sauce, wasabi, and pickled ginger. Itadakimasu!"
      ],
      "prepTime": "40 mins",
      "cookTime": "20 mins",
      "servings": 4,
      "image": "/assets/recipes/sushi-rolls.jpg",
      "cuisine": "Japanese",
      "tags": [
        "Sushi",
        "Seafood",
        "Dinner"
      ],
      "isFavorite": false
    },
    {
      "id": "9",
      "title": "Pancakes",
      "description": "Fluffy breakfast cakes served with syrup.",
      "ingredients": [
        "1 cup Flour",
        "1 cup Milk",
        "1 Egg",
        "1 tbsp Sugar",
        "1 tsp Baking Powder",
        "Maple Syrup"
      ],
      "steps": [
        "In a large bowl, whisk together 1 cup all-purpose flour, 1 tbsp sugar, 1 tsp baking powder, and a pinch of salt until well combined.",
        "In a separate bowl, whisk together 1 cup milk, 1 large egg, and 2 tbsp melted butter until smooth and well combined.",
        "Pour the wet ingredients into the dry ingredients. Gently fold together using a spatula until just combined. Don't overmix - a few lumps are okay. Let the batter rest for 5 minutes.",
        "Heat a non-stick griddle or pan over medium heat. Lightly grease with butter. Pour 1/4 cup of batter for each pancake. Cook until bubbles form on the surface and edges look set (about 2-3 minutes).",
        "Flip the pancakes carefully and cook for another 1-2 minutes until golden brown. Stack on a plate and serve warm with maple syrup, fresh berries, whipped cream, or your favorite toppings. Enjoy your fluffy homemade pancakes!"
      ],
      "prepTime": "40 mins",
      "cookTime": "15 mins",
      "servings": 4,
      "image": "/assets/recipes/pancakes.png",
      "cuisine": "American",
      "tags": [
        "Breakfast",
        "Sweet",
        "Vegetarian"
      ],
      "isFavorite": false
    },
    {
      "id": "10",
      "title": "Pad Thai",
      "description": "Stir-fried rice noodle dish commonly served as a street food in Thailand.",
      "ingredients": [
        "200g Rice Noodles",
        "100g Shrimp",
        "2 Eggs",
        "Bean Sprouts",
        "Peanuts",
        "Pad Thai Sauce"
      ],
      "steps": [
        "Soak 200g rice noodles in warm water for 20-30 minutes until soft and pliable. Drain and set aside.",
        "Heat 2 tbsp oil in a large wok over high heat. Add 100g peeled shrimp and stir-fry for 2 minutes. Push to one side, crack 2 eggs into the wok, and scramble until just set.",
        "Add the drained noodles to the wok. Pour in 3 tbsp Pad Thai sauce (or mix tamarind paste, fish sauce, and palm sugar). Toss everything together for 2-3 minutes until noodles are well coated and heated through.",
        "Add a handful of fresh bean sprouts and 2 tbsp crushed peanuts. Toss for another minute until bean sprouts are slightly wilted but still crunchy.",
        "Transfer to serving plates. Garnish with more crushed peanuts, fresh bean sprouts, lime wedges, and sliced green onions. Serve immediately with lime wedges on the side. Squeeze lime juice over before eating for authentic flavor!"
      ],
      "prepTime": "40 mins",
      "cookTime": "10 mins",
      "servings": 2,
      "image": "/assets/recipes/pad-thai.png",
      "cuisine": "Thai",
      "tags": [
        "Noodles",
        "Seafood",
        "Spicy"
      ],
      "isFavorite": false
    },
    {
      "id": "11",
      "title": "Butter Chicken",
      "description": "Tender chicken cooked in a creamy tomato sauce with aromatic spices.",
      "ingredients": [
        "500g Chicken Thighs",
        "1 cup Tomato Puree",
        "1/2 cup Heavy Cream",
        "2 tbsp Butter",
        "1 tbsp Garam Masala",
        "Kasuri Methi"
      ],
      "steps": [
        "Cut chicken thighs into bite-sized pieces. In a bowl, mix 1/2 cup yogurt, 1 tsp garam masala, 1/2 tsp turmeric, 1 tsp red chili powder, and salt. Marinate chicken for at least 2 hours or overnight in the refrigerator.",
        "Preheat oven to 200°C (400°F). Place marinated chicken on a baking tray and cook for 20-25 minutes until slightly charred and cooked through. Alternatively, grill in a tandoor or on a barbecue.",
        "In a large pan, melt 2 tablespoons of butter over medium heat. Add 1 cup tomato puree, 1 tbsp garam masala, 1 tsp kasuri methi (dried fenugreek leaves), and salt. Simmer for 10 minutes, stirring occasionally.",
        "Add the cooked chicken pieces to the sauce. Pour in 1/2 cup heavy cream and mix well. Simmer for another 5-7 minutes until the sauce thickens and coats the chicken.",
        "Taste and adjust seasoning. Garnish with a swirl of cream, fresh kasuri methi, and chopped coriander. Serve hot with naan, roti, or basmati rice."
      ],
      "prepTime": "45 mins",
      "cookTime": "30 mins",
      "servings": 4,
      "image": "/assets/recipes/butter-chicken.png",
      "cuisine": "Indian",
      "tags": [
        "Curry",
        "Creamy",
        "Chicken"
      ],
      "isFavorite": false
    },
    {
      "id": "12",
      "title": "Chicken Biryani",
      "description": "A fragrant rice dish made with basmati rice, chicken, and aromatic spices.",
      "ingredients": [
        "2 cups Basmati Rice",
        "500g Chicken",
        "2 Onions",
        "1/2 cup Yogurt",
        "Saffron",
        "Biryani Masala"
      ],
      "steps": [
        "Cut 500g chicken into pieces. Mix with 1/2 cup yogurt, 2 tbsp biryani masala, ginger-garlic paste, salt, and lemon juice. Marinate for at least 1 hour.",
        "Wash 2 cups basmati rice and soak for 30 minutes. Boil water with whole spices (bay leaves, cinnamon, cardamom, cloves) and salt. Add rice and cook until 70% done. Drain and set aside.",
        "In a heavy-bottomed pot, heat oil and cook the marinated chicken until half done. Layer the par-boiled rice over the chicken evenly.",
        "Slice 2 onions thinly and deep fry until golden brown. Sprinkle fried onions on top of rice. Mix a pinch of saffron in 1/4 cup warm milk and drizzle over the rice. Add dots of ghee.",
        "Cover the pot tightly with aluminum foil and then a lid. Cook on high heat for 3-4 minutes, then reduce to low heat and cook for 20-25 minutes (dum cooking). Turn off heat and let it rest for 5 minutes before opening. Gently mix and serve hot with raita."
      ],
      "prepTime": "45 mins",
      "cookTime": "40 mins",
      "servings": 6,
      "image": "/assets/recipes/chicken-biryani.jpg",
      "cuisine": "Indian",
      "tags": [
        "Rice",
        "Spicy",
        "Dinner"
      ],
      "isFavorite": false
    },
    {
      "id": "13",
      "title": "Palak Paneer",
      "description": "Cottage cheese cubes cooked in a smooth spinach gravy.",
      "ingredients": [
        "200g Paneer",
        "2 bunches Spinach",
        "1 Onion",
        "1 Tomato",
        "1 tsp Cumin Seeds",
        "2 tbsp Cream"
      ],
      "steps": [
        "Wash 2 bunches of fresh spinach thoroughly. Blanch in boiling water for 2-3 minutes, then immediately transfer to ice-cold water. Drain and blend into a smooth puree. Set aside.",
        "Heat 2 tbsp oil in a pan. Add 1 tsp cumin seeds and let them crackle. Add finely chopped onions and sauté until golden. Add ginger-garlic paste and cook for 1 minute. Add chopped tomatoes and cook until soft.",
        "Add the spinach puree to the pan along with 1/2 tsp turmeric, 1 tsp coriander powder, 1/2 tsp garam masala, and salt. Mix well and simmer for 8-10 minutes on low heat, stirring occasionally.",
        "Cut 200g paneer into cubes. Gently add paneer cubes to the spinach gravy. Add 2 tbsp cream and mix carefully. Cook for 3-4 minutes until paneer is heated through.",
        "Taste and adjust seasoning. Garnish with a drizzle of cream. Serve hot with naan, roti, or jeera rice. Enjoy your healthy and delicious Palak Paneer!"
      ],
      "prepTime": "40 mins",
      "cookTime": "20 mins",
      "servings": 4,
      "image": "/assets/recipes/palak-paneer.jpg",
      "cuisine": "Indian",
      "tags": [
        "Vegetarian",
        "Healthy",
        "Curry"
      ],
      "isFavorite": false
    },
    {
      "id": "14",
      "title": "Chana Masala",
      "description": "Spicy and tangy chickpea curry.",
      "ingredients": [
        "2 cups Chickpeas (boiled)",
        "2 Onions",
        "2 Tomatoes",
        "1 tbsp Chana Masala Powder",
        "Ginger-Garlic Paste",
        "Coriander"
      ],
      "steps": [
        "If using dried chickpeas, soak 1 cup overnight and pressure cook until soft. Or use 2 cups canned chickpeas, drained and rinsed.",
        "Heat 3 tbsp oil in a large pan. Add 2 finely chopped onions and sauté over medium heat for 6-8 minutes until golden brown. Add 1 tbsp ginger-garlic paste and cook for 1 minute until fragrant.",
        "Add 2 finely chopped tomatoes, 1 tbsp chana masala powder, 1 tsp cumin powder, 1/2 tsp turmeric, 1 tsp coriander powder, and salt. Cook for 5-7 minutes until tomatoes are soft and oil separates from the masala.",
        "Add the cooked chickpeas along with 1 cup water. Mix well and bring to a boil. Reduce heat and simmer for 15-20 minutes, stirring occasionally, until the gravy thickens and chickpeas absorb the flavors.",
        "Mash a few chickpeas with the back of a spoon to thicken the gravy. Garnish with fresh chopped coriander, a squeeze of lemon juice, and sliced green chilies. Serve hot with bhatura, puri, or rice. Delicious and protein-packed!"
      ],
      "prepTime": "40 mins",
      "cookTime": "20 mins",
      "servings": 4,
      "image": "/assets/recipes/chana-masala.png",
      "cuisine": "Indian",
      "tags": [
        "Vegetarian",
        "Vegan",
        "Spicy"
      ],
      "isFavorite": false
    },
    {
      "id": "15",
      "title": "Samosas",
      "description": "Crispy pastry filled with spiced potatoes and peas.",
      "ingredients": [
        "2 cups All-Purpose Flour",
        "3 Potatoes (boiled)",
        "1/2 cup Peas",
        "1 tsp Cumin Seeds",
        "Green Chilies",
        "Oil for frying"
      ],
      "steps": [
        "Make the dough: Mix 2 cups all-purpose flour with 1/4 cup oil, a pinch of salt, and enough water to form a stiff dough. Knead for 5 minutes until smooth. Cover and rest for 30 minutes.",
        "Prepare the filling: Boil and mash 3 large potatoes. Heat 2 tbsp oil, add 1 tsp cumin seeds, then add mashed potatoes, 1/2 cup boiled peas, 1 tsp garam masala, 1/2 tsp amchur (dry mango powder), chopped green chilies, and salt. Mix well and let cool.",
        "Divide dough into equal balls. Roll each into an oval, cut in half to make semi-circles. Form each semi-circle into a cone shape by folding and sealing the straight edge with water.",
        "Fill each cone with 1-2 tablespoons of potato filling. Seal the top edge with water, pressing firmly to ensure no gaps. Repeat with remaining dough and filling.",
        "Heat oil in a deep pan to 160-170°C (medium heat). Fry samosas in batches for 8-10 minutes, turning occasionally, until golden brown and crispy. Drain on paper towels. Serve hot with mint chutney and tamarind chutney. Perfect tea-time snack!"
      ],
      "prepTime": "40 mins",
      "cookTime": "20 mins",
      "servings": 6,
      "image": "/assets/recipes/samosas.jpg",
      "cuisine": "Indian",
      "tags": [
        "Snack",
        "Vegetarian",
        "Fried"
      ],
      "isFavorite": false
    },
    {
      "id": "16",
      "title": "Garlic Naan",
      "description": "Soft and fluffy Indian flatbread topped with garlic and butter.",
      "ingredients": [
        "2 cups Flour",
        "1/2 cup Yogurt",
        "1 tsp Yeast",
        "Minced Garlic",
        "Butter",
        "Coriander"
      ],
      "steps": [
        "In a large bowl, mix 2 cups all-purpose flour, 1/2 cup plain yogurt, 1 tsp instant yeast, 1 tsp sugar, 1/2 tsp salt, and 2 tbsp oil. Add warm water gradually to form a soft, sticky dough. Knead for 8-10 minutes until smooth and elastic.",
        "Cover the dough with a damp cloth and let it rise in a warm place for 2 hours until it doubles in size. This fermentation gives naan its characteristic flavor and texture.",
        "Punch down the dough and divide into 6-8 equal portions. Roll each into an oval or teardrop shape about 1/4 inch thick. Brush with water and sprinkle minced garlic and chopped coriander on one side.",
        "Heat a cast-iron skillet or tawa over high heat. Place the naan garlic-side down and cook for 1-2 minutes until bubbles form. Flip and cook for another 1-2 minutes until charred spots appear. For authentic texture, you can also stick it to the walls of a tandoor or very hot oven.",
        "Remove from heat and immediately brush generously with melted butter or ghee. Sprinkle with more chopped coriander. Serve hot with any curry, dal, or kebabs. Absolutely irresistible!"
      ],
      "prepTime": "40 mins",
      "cookTime": "10 mins",
      "servings": 4,
      "image": "/assets/recipes/garlic-naan.png",
      "cuisine": "Indian",
      "tags": [
        "Bread",
        "Side",
        "Vegetarian"
      ],
      "isFavorite": false
    },
    {
      "id": "17",
      "title": "Lamb Vindaloo",
      "description": "A fiery and tangy curry from Goa made with lamb.",
      "ingredients": [
        "500g Lamb",
        "Vindaloo Paste",
        "Vinegar",
        "Potatoes",
        "Onions",
        "Garlic"
      ],
      "steps": [
        "Cut 500g lamb into 1-inch cubes. In a bowl, mix 3 tbsp vindaloo paste, 2 tbsp vinegar, 1 tsp sugar, and salt. Add lamb and marinate for at least 2 hours or overnight in the refrigerator for deeper flavor.",
        "Heat 3 tbsp oil in a heavy-bottomed pot. Add 2 sliced onions and 4 cloves minced garlic. Sauté over medium heat for 8-10 minutes until onions are golden brown and caramelized.",
        "Add the marinated lamb along with all the marinade. Cook on high heat for 5-7 minutes, stirring frequently, until the lamb is browned on all sides.",
        "Add 2 peeled and cubed potatoes and 1.5 cups water. Bring to a boil, then reduce heat to low. Cover and simmer for 45-60 minutes until the lamb is tender and potatoes are cooked through. Stir occasionally and add more water if needed.",
        "The curry should be thick and rich with oil floating on top. Taste and adjust seasoning with salt and vinegar. Garnish with fresh coriander. Serve hot with steamed rice or crusty bread. This fiery Goan curry is not for the faint-hearted!"
      ],
      "prepTime": "45 mins",
      "cookTime": "1 hr",
      "servings": 4,
      "image": "/assets/recipes/lamb-vindaloo.jpg",
      "cuisine": "Indian",
      "tags": [
        "Spicy",
        "Curry",
        "Lamb"
      ],
      "isFavorite": false
    },
    {
      "id": "18",
      "title": "Tandoori Chicken",
      "description": "Chicken legs marinated in yogurt and spices, roasted to perfection.",
      "ingredients": [
        "4 Chicken Legs",
        "1 cup Yogurt",
        "1 tbsp Tandoori Masala",
        "Lemon Juice",
        "Ginger-Garlic Paste",
        "Red Chili Powder"
      ],
      "steps": [
        "Make 3-4 deep cuts on each of 4 chicken legs (drumsticks and thighs work best). This helps the marinade penetrate deeply.",
        "In a large bowl, mix 1 cup thick yogurt, 1 tbsp tandoori masala, 1 tbsp ginger-garlic paste, 1 tsp red chili powder, 1/2 tsp turmeric, 2 tbsp lemon juice, 2 tbsp oil, and salt. Add chicken and coat well. Marinate for at least 4 hours or preferably overnight in the refrigerator.",
        "Preheat oven to 220°C (425°F). Place marinated chicken on a wire rack over a baking tray (to catch drippings). Roast for 25-30 minutes, turning once halfway through.",
        "Melt 2 tbsp butter and baste the chicken. Return to oven and cook for another 5-10 minutes until chicken is charred in spots and cooked through (internal temperature 75°C/165°F).",
        "Remove from oven and let rest for 5 minutes. Garnish with fresh lemon wedges, sliced onions, and mint chutney. Serve hot with naan and a side salad. The smoky, spicy flavors are absolutely addictive!"
      ],
      "prepTime": "45 mins",
      "cookTime": "30 mins",
      "servings": 4,
      "image": "/assets/recipes/tandoori-chicken.png",
      "cuisine": "Indian",
      "tags": [
        "Grilled",
        "Spicy",
        "Chicken"
      ],
      "isFavorite": false
    },
    {
      "id": "19",
      "title": "Dal Makhani",
      "description": "Creamy black lentils cooked overnight with butter and spices.",
      "ingredients": [
        "1 cup Black Lentils",
        "1/2 cup Kidney Beans",
        "Butter",
        "Cream",
        "Tomato Puree",
        "Ginger-Garlic Paste"
      ],
      "steps": [
        "Soak 1 cup whole black lentils (urad dal) and 1/2 cup red kidney beans (rajma) in plenty of water overnight (at least 8 hours). This is crucial for proper cooking.",
        "Drain and rinse the soaked lentils and beans. Pressure cook with 4 cups water and salt for 6-7 whistles (or about 25-30 minutes) until very soft and creamy. If using a pot, cook for 1.5-2 hours until completely tender.",
        "In a separate large pan, heat 3 tbsp butter. Add 1 tbsp ginger-garlic paste and sauté for 1 minute. Add 1 cup tomato puree, 1 tsp garam masala, 1 tsp cumin powder, 1/2 tsp red chili powder, and salt. Cook for 8-10 minutes until the masala is well cooked and oil separates.",
        "Add the cooked lentils and beans along with their cooking liquid to the masala. Add 2 tbsp butter and mix well. Simmer on very low heat for 30-40 minutes, stirring occasionally. The longer it cooks, the creamier it becomes. Add water if it gets too thick.",
        "Finish with 1/4 cup heavy cream and 1 tbsp butter. Mix well and simmer for 5 more minutes. Garnish with a swirl of cream and fresh coriander. Serve hot with naan or jeera rice. This rich, creamy dal is pure comfort food!"
      ],
      "prepTime": "40 mins",
      "cookTime": "1 hr",
      "servings": 6,
      "image": "/assets/recipes/dal-makhani.jpg",
      "cuisine": "Indian",
      "tags": [
        "Vegetarian",
        "Creamy",
        "Lentils"
      ],
      "isFavorite": false
    },
    {
      "id": "20",
      "title": "Malai Kofta",
      "description": "Fried potato and paneer balls in a rich, creamy cashew gravy.",
      "ingredients": [
        "2 Potatoes (boiled)",
        "100g Paneer",
        "Cashews",
        "Cream",
        "Onions",
        "Tomatoes"
      ],
      "steps": [
        "Boil, peel, and mash 2 large potatoes until smooth. Grate 100g paneer finely. Mix together with 2 tbsp cornstarch, 1/4 tsp garam masala, salt, and chopped coriander. Form into small, smooth balls (koftas). You should get about 10-12 koftas.",
        "Heat oil in a deep pan for frying. Once hot (170°C), gently slide in the koftas and deep fry on medium heat for 4-5 minutes until golden brown and crispy. Remove and drain on paper towels. Set aside and do not add to gravy until serving.",
        "For the gravy: Soak 1/4 cup cashews in hot water for 20 minutes, then blend into a smooth paste. In a pan, heat 2 tbsp oil/butter, add 1 chopped onion and cook until golden. Add 2 chopped tomatoes and cook until soft. Let cool, then blend into a smooth puree.",
        "Heat 2 tbsp butter in the same pan. Add the onion-tomato puree, cashew paste, 1 tsp garam masala, 1/2 tsp red chili powder, and salt. Cook for 8-10 minutes, stirring frequently. Add 1/2 cup cream and 1 cup water. Simmer for 5-7 minutes until the gravy is smooth and creamy.",
        "Just before serving, gently place the fried koftas in the hot gravy (don't add too early or they'll become soggy). Garnish with cream and chopped coriander. Serve immediately with naan or pulao. A royal dish fit for special occasions!"
      ],
      "prepTime": "40 mins",
      "cookTime": "30 mins",
      "servings": 4,
      "image": "/assets/recipes/malai-kofta.jpg",
      "cuisine": "Indian",
      "tags": [
        "Vegetarian",
        "Rich",
        "Dinner"
      ],
      "isFavorite": false
    },
    {
      "id": "21",
      "title": "Aloo Gobi",
      "description": "Stir-fried potatoes and cauliflower with turmeric and spices.",
      "ingredients": [
        "1 Cauliflower",
        "2 Potatoes",
        "1 Onion",
        "1 Tomato",
        "Turmeric",
        "Cumin Seeds"
      ],
      "steps": [
        "Wash and cut the cauliflower into medium-sized florets. Peel the potatoes and cut them into 1-inch cubes. Keep them in separate bowls.",
        "Heat 3 tablespoons of oil in a large pan or kadhai over medium heat. Add 1 teaspoon of cumin seeds and let them sizzle for 10-15 seconds until fragrant.",
        "Add finely chopped onions to the pan and sauté for 4-5 minutes until they turn golden brown, stirring occasionally.",
        "Add finely chopped tomatoes, turmeric powder (1/2 tsp), red chili powder (1/2 tsp), and salt to taste. Cook for 3-4 minutes until tomatoes soften and oil separates from the masala.",
        "Add the potato cubes first and mix well with the masala. Cook covered on medium heat for 5 minutes, stirring occasionally.",
        "Now add the cauliflower florets and mix gently. Add 1/4 cup of water, cover the pan, and cook on low-medium heat for 12-15 minutes until both vegetables are tender. Stir every 3-4 minutes to prevent sticking.",
        "Once vegetables are cooked through, remove the lid and cook for 2 more minutes on high heat to evaporate excess moisture.",
        "Garnish with freshly chopped coriander leaves and serve hot with roti, paratha, or rice. Enjoy your homemade Aloo Gobi!"
      ],
      "prepTime": "40 mins",
      "cookTime": "20 mins",
      "servings": 4,
      "image": "/assets/recipes/aloo-gobi.jpg",
      "cuisine": "Indian",
      "tags": [
        "Vegetarian",
        "Vegan",
        "Healthy"
      ],
      "isFavorite": false
    },
    {
      "id": "22",
      "title": "Risotto ai Funghi",
      "description": "Creamy Italian rice dish cooked with mixed mushrooms, white wine, and parmesan cheese.",
      "ingredients": [
        "300g Arborio Rice",
        "400g Mixed Mushrooms",
        "1L Vegetable Broth",
        "1/2 cup White Wine",
        "1 Onion",
        "2 cloves Garlic",
        "50g Butter",
        "50g Parmesan Cheese"
      ],
      "steps": [
        "Clean and slice 400g mixed mushrooms (cremini, shiitake, or button mushrooms work well). Heat 2 tbsp butter in a large pan and sauté mushrooms over high heat for 5-7 minutes until golden brown and all moisture evaporates. Season with salt and pepper. Remove and set aside.",
        "In the same pan, add 1 tbsp butter and 1 tbsp olive oil. Add 1 finely chopped onion and 2 minced garlic cloves. Sauté over medium heat for 4-5 minutes until soft and translucent but not browned.",
        "Add 300g Arborio rice and toast for 2 minutes, stirring constantly, until the edges become translucent. This step is crucial for creamy risotto.",
        "Pour in 1/2 cup white wine and stir until completely absorbed. Meanwhile, keep 1 liter vegetable broth hot in a separate pot.",
        "Add hot broth one ladle at a time (about 1/2 cup), stirring constantly. Wait until each addition is almost completely absorbed before adding the next. This process takes about 18-20 minutes. The rice should be creamy and al dente.",
        "Stir in the sautéed mushrooms, remaining 2 tbsp butter, and 50g freshly grated Parmesan cheese. Stir vigorously for 1 minute until creamy. Season with salt and pepper.",
        "Serve immediately in warm bowls. Garnish with extra Parmesan, fresh parsley, and a drizzle of truffle oil if desired. Risotto waits for no one - enjoy while hot and creamy!"
      ],
      "prepTime": "40 mins",
      "cookTime": "30 mins",
      "servings": 4,
      "image": "/assets/recipes/risotto.jpg",
      "cuisine": "Italian",
      "tags": [
        "Italian",
        "Dinner",
        "Vegetarian",
        "Gluten-Free"
      ],
      "isFavorite": false
    },
    {
      "id": "23",
      "title": "Chettinad Chicken",
      "description": "Spicy and aromatic chicken curry from the Chettinad region of Tamil Nadu.",
      "ingredients": [
        "500g Chicken",
        "Chettinad Masala",
        "Coconut",
        "Curry Leaves",
        "Onions",
        "Tomatoes"
      ],
      "steps": [
        "Dry roast spices (coriander, cumin, fennel, pepper, red chilies) and coconut until golden. Grind to a fine paste.",
        "Heat oil in a pan, add curry leaves and onions. Sauté until golden brown.",
        "Add tomatoes and cook until soft. Add the ground masala paste and cook for 5 minutes.",
        "Add chicken pieces and coat well with the masala. Add water and salt.",
        "Cover and cook until chicken is tender and the gravy thickens. Garnish with fresh coriander."
      ],
      "prepTime": "45 mins",
      "cookTime": "40 mins",
      "servings": 4,
      "image": "/assets/recipes/chettinad-chicken.jpg",
      "cuisine": "Indian",
      "tags": [
        "Spicy",
        "Curry",
        "Chicken"
      ],
      "isFavorite": false
    },
    {
      "id": "24",
      "title": "Gongura Chicken",
      "description": "Tangy and spicy chicken curry made with sorrel leaves (gongura).",
      "ingredients": [
        "500g Chicken",
        "2 bunches Gongura Leaves",
        "Onions",
        "Green Chilies",
        "Ginger-Garlic Paste",
        "Spices"
      ],
      "steps": [
        "Wash gongura leaves and cook them with a little water until soft. Mash into a paste.",
        "Marinate chicken with ginger-garlic paste, chili powder, and salt.",
        "Heat oil, sauté onions and green chilies. Add marinated chicken and cook until half done.",
        "Add the gongura paste and cook on low heat until the oil separates and chicken is fully cooked.",
        "Serve hot with steamed rice and ghee."
      ],
      "prepTime": "45 mins",
      "cookTime": "30 mins",
      "servings": 4,
      "image": "/assets/recipes/gongura-chicken.jpg",
      "cuisine": "Indian",
      "tags": [
        "Spicy",
        "Tangy",
        "Chicken"
      ],
      "isFavorite": false
    },
    {
      "id": "25",
      "title": "Hyderabadi Haleem",
      "description": "A rich and wholesome stew made of meat, lentils, and pounded wheat.",
      "ingredients": [
        "500g Mutton (Boneless)",
        "1/2 cup Broken Wheat",
        "1/4 cup Lentils (Chana/Urad)",
        "Ghee",
        "Fried Onions",
        "Spices"
      ],
      "steps": [
        "Soak broken wheat and lentils for 2 hours. Cook mutton with ginger-garlic paste and spices until very tender.",
        "Cook the soaked wheat and lentils until soft. Mash everything together with the mutton.",
        "Add ghee and cook on low heat, stirring continuously (ghota) until the mixture becomes sticky and elastic.",
        "Garnish with fried onions, cashew nuts, coriander, and lemon juice. Serve hot."
      ],
      "prepTime": "45 mins",
      "cookTime": "2 hrs",
      "servings": 6,
      "image": "/assets/recipes/hyderabadi-haleem.png",
      "cuisine": "Indian",
      "tags": [
        "Rich",
        "Meat",
        "Traditional"
      ],
      "isFavorite": false
    },
    {
      "id": "26",
      "title": "Mutton Biryani",
      "description": "A classic royal dish with layers of spiced mutton and fragrant basmati rice.",
      "ingredients": [
        "500g Mutton",
        "2 cups Basmati Rice",
        "Yogurt",
        "Fried Onions",
        "Saffron",
        "Whole Spices"
      ],
      "steps": [
        "Marinate mutton with yogurt, ginger-garlic paste, raw papaya paste (tenderizer), and spices overnight.",
        "Cook basmati rice with whole spices until 70% done.",
        "Layer the marinated mutton and rice in a heavy-bottomed pot. Top with fried onions, saffron milk, and ghee.",
        "Seal the pot and cook on low heat (dum) for 45 minutes to 1 hour.",
        "Let it rest for 10 minutes before serving. Serve with raita and mirchi ka salan."
      ],
      "prepTime": "45 mins",
      "cookTime": "1 hr",
      "servings": 6,
      "image": "/assets/recipes/mutton-biryani.jpg",
      "cuisine": "Indian",
      "tags": [
        "Rice",
        "Spicy",
        "Dinner"
      ],
      "isFavorite": false
    },
    {
      "id": "d9c8",
      "title": "fish fry ",
      "description": "cook the recipe ",
      "ingredients": [
        "fish"
      ],
      "steps": [
        "cook at normal heat"
      ],
      "prepTime": "40",
      "cookTime": "1hr",
      "servings": 2,
      "image": "https://i0.wp.com/gomathirecipes.com/wp-content/uploads/2022/09/5-20.jpg?resize=500%2C500&ssl=1",
      "cuisine": "indian",
      "tags": [
        "lunch"
      ],
      "isFavorite": false
    }
  ],
  "favorites": [
    {
      "id": "489e",
      "userId": "4ba7",
      "recipeId": "26"
    }
  ]
}